public class Main {
    public static void main(String[] args) {

//Задача 1 Сделать калькулятор для простейших арифметических действий с двумя числами
// (сложение,вычитание, умножение и деление). Защититься от ввода символов вместо чисел и от деления на 0.
// Интерфейс организовать так, чтобы пользователь мог продолжить работу с калькулятором до тех пор,
// пока он не откажется.


//-----------------------------------------------------------------------------------------------------------

//Задача 2 Заполнить массив 10 х 10 случайными числами 0 или 1.
// Для каждой строки подсчиать сумму всех элементов массива в этой строке.

//------------------------------------------------------------------------------------------------------------
//Задача 3 (*) Решение квадратного уравнения с коэффициентами a, b, c.
// Для извлечения квадратного корня импортировать класс Math.







    }
}